app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def retrieve_current_user
      if session[:user_token] != nil
        user = User.find_by(id: session[:user_token])