app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = @current_user
    if @article.save
      redirect_to articles_path
    else
      redirect_to new_article_path, notice: 'Wrong'
    end
    @historical = Historical.new(article_params)
    @historical.user_id = @current_user.id
    @historical.article_id = @article.id
    @historical.save
---
INSERT INTO "historicals" ("title", "content", "created_at", "updated_at", "article_id") VALUES (?, ?, ?, ?, ?)  [["title", "dcvf"], ["content", "dfvf"], ["created_at", "2020-12-15 11:38:48.161942"], ["updated_at", "2020-12-15 11:38:48.161942"], ["article_id", 11]]

  def update
    if @article.update(article_params)
      @historical = Historical.new(article_params)
      @historical.user_id = @current_user.id
      @historical.article_id = @article.id
      @historical.save
      UserMailer.with(
        author: @article.user,
        editor: @current_user,
        date: @article.updated_at
      ).notif_update.deliver_later
---
INSERT INTO "historicals" ("title", "content", "created_at", "updated_at", "article_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Leo"], ["content", "SALLLLLUUUUTTTT"], ["created_at", "2020-12-15 15:52:19.230164"], ["updated_at", "2020-12-15 15:52:19.230164"], ["article_id", 12], ["user_id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]