app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaron"], ["content", "azertyuiopmlkjhgfdswxcvbn,"], ["created_at", "2020-12-13 16:33:00.370087"], ["updated_at", "2020-12-13 16:33:00.370087"], ["user_id", 8]]
---
  def create
    @article = Article.new(article_params)
    @article.user = @current_user
    if @article.save

UPDATE "articles" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "COUCOU"], ["title", "LEOOOOO"], ["updated_at", "2020-12-18 12:56:03.188194"], ["id", 32]]
UPDATE "users" SET "point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["point", 1], ["updated_at", "2020-12-16 16:12:42.641891"], ["id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "SALLLLLU"], ["updated_at", "2020-12-16 16:17:33.519597"], ["id", 29]]
---
  def update
    if @article.update(article_params)
      add_historical
      add_point_user(0.5)
      UserMailer.with(
        author: @article.user,
        editor: @current_user,
        date: @article.updated_at
      ).notif_update.deliver_later

SELECT "historicals".* FROM "historicals" WHERE "historicals"."article_id" = ?  [["article_id", 34]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 11]]
DELETE FROM "historicals" WHERE "historicals"."id" = ?  [["id", 19]]
DELETE FROM "historicals" WHERE "historicals"."id" = ?  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 34]]
---
  def destroy
    @historical = Historical.where(article_id: @article.id)
    @historical.destroy_all
    @article.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "point" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["point", 5.0], ["updated_at", "2020-12-16 16:50:00.015885"], ["id", 8]]
---
  def add_point_user(x)
    @user = User.find(@current_user.id)
    @user.update_attribute('point', @user.point + x)

INSERT INTO "historicals" ("title", "content", "created_at", "updated_at", "article_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "aaron"], ["content", "SALLLLLUU"], ["created_at", "2020-12-16 16:49:59.993351"], ["updated_at", "2020-12-16 16:49:59.993351"], ["article_id", 31], ["user_id", 8]]
---
  def add_historical
    @historical = Historical.new(article_params)
    @historical.user_id = @current_user.id
    @historical.article_id = @article.id
    @historical.save