app/controllers/historicals_controller.rb

  def index
    # @historicals = Historical.all
    @historicals = Historical.where(article_id: params[:id])
---
SELECT "historicals".* FROM "historicals" WHERE "historicals"."article_id" = ? LIMIT ?  [["article_id", nil], ["LIMIT", 1]]

  def retrieve_history
    @historical = Historical.find(params[:id])
    @article = Article.find(@historical.article_id)
    @article.update_attribute('title', @historical.title)
    @article.update_attribute('content', @historical.content)
    if @article.update_attribute('title', 'content')
---
SELECT "historicals".* FROM "historicals" WHERE "historicals"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "historicals".* FROM "historicals" WHERE "historicals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "aaron"], ["updated_at", "2020-12-18 12:56:10.479452"], ["id", 32]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "SALLLLLUUU"], ["updated_at", "2020-12-18 12:55:49.634446"], ["id", 32]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "content"], ["updated_at", "2020-12-18 13:04:47.399317"], ["id", 37]]

    def set_historical
      @historical = Historical.find(params[:id])
---
SELECT "historicals".* FROM "historicals" WHERE "historicals"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]