app/controllers/users_controller.rb

  def ranking
    @users = User.order(point: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."point" DESC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "aaron"], ["email", "saksik95@gmail.com"], ["password_digest", "azertyuiop"], ["created_at", "2020-12-08 16:22:23.457744"], ["updated_at", "2020-12-08 16:22:23.457744"]]