app/models/article.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "aaron99"], ["LIMIT", 1]]
SELECT "usertags".* FROM "usertags" WHERE "usertags"."user_id" = ? LIMIT ?  [["user_id", 8], ["LIMIT", 1]]
INSERT INTO "usertags" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2020-12-17 00:07:15.187139"], ["updated_at", "2020-12-17 00:07:15.187139"], ["user_id", 9]]
---
    def find_user_by_mention(mention)
        username = mention.delete_prefix('@')
        mentionned_user = User.find_by(username: username)
        if mentionned_user
          fetched = Usertag.find_by(user_id: mentionned_user.id)
          return fetched || Usertag.create(user: mentionned_user)